<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AreaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $areas = [
            1101 => "風やゴムの働き",
            1102 => "振り子の運動",
            1103 => "てこの規則性",
            1104 => "電気の通り道",
            1105 => "磁石の性質",
            1106 => "電気の働き",
            1107 => "電流の働き",
            1108 => "電気の利用",
            1109 => "光の性質",
            1201 => "力と圧力",
            1202 => "運動の規則性",
            1203 => "力学的エネルギー",
            1204 => "エネルギー",
            1205 => "電流",
            1206 => "電流と磁界",
            1207 => "光と音",
            1301 => "力学",
            1302 => "熱力学",
            1303 => "電磁気学",
            1304 => "波動",
            2101 => "物と重さ",
            2102 => "空気と水の性質",
            2103 => "金属、水、空気と温度",
            2104 => "物の溶け方",
            2105 => "燃焼の仕組み",
            2106 => "水溶性の性質",
            2201 => "物質のすがた",
            2202 => "水溶液",
            2203 => "状態変化",
            2204 => "物質の成り立ち",
            2205 => "化学変化",
            2206 => "化学変化と物質の質量",
            2207 => "水溶液とイオン",
            2208 => "酸・アルカリとイオン",
            2301 => "理論化学",
            2302 => "無機化学",
            2303 => "有機化学",
            2304 => "高分子化合物",
            3101 => "昆虫と植物",
            3102 => "季節と生物",
            3103 => "人の体の作りと運動",
            3104 => "植物の発芽、成長、結実",
            3105 => "動物の誕生",
            3106 => "植物の養分と水の通り道",
            3107 => "人の体のつくりと働き",
            3201 => "植物の体のつくりと働き",
            3202 => "植物の仲間",
            3203 => "生物と細胞",
            3204 => "動物の体のつくりと働き",
            3205 => "動物の仲間",
            3206 => "生物の変遷と進化",
            3207 => "生物の成長と殖え方",
            3208 => "遺伝の規則性と遺伝子",
            3301 => "植生の多様性と分布",
            3302 => "生物の体内環境",
            3303 => "生物の特徴",
            3304 => "遺伝子とその働き",
            4101 => "太陽と地面の様子",
            4102 => "天気の様子",
            4103 => "月と星",
            4104 => "流水の働き",
            4105 => "天気の変化",
            4106 => "土地のつくりと変化",
            4107 => "月と太陽",
            4201 => "火山と地震",
            4202 => "地層の重なりと過去の様子",
            4203 => "気象観測",
            4204 => "天気の変化",
            4205 => "日本の気象",
            4206 => "天体の動きと地球の自転・公転",
            4207 => "太陽系と恒星",
            4301 => "活動する地球",
            4302 => "移り変わる地球",
            4303 => "大気と海洋",
            4304 => "宇宙の構成",
            4305 => "惑星としての地球",
            5101 => "数と計算",
            5102 => "量と測定",
            5103 => "図形",
            5104 => "数量関係",
            5201 => "数と式",
            5202 => "図形",
            5203 => "関数",
            5204 => "資料の活用",
            5301 => "数学Ⅰ",
            5302 => "数学A",
            5303 => "数学Ⅱ",
            5304 => "数学B",
            5305 => "数学Ⅲ",
            5306 => "数学C"
        ];
        foreach ($areas as $k => $v) {
            $subject = substr($k, 0, 1);
            $grade = substr($k, 1, 1);
            if ($subject == 1) {
                $subject = '物理';
            } elseif ($subject == 2) {
                $subject = '科学';
            } elseif ($subject == 3) {
                $subject = '生物';
            } elseif ($subject == 4) {
                $subject = '地学';
            } else {
                $subject = '数学';
            }

            if ($grade == 1) {
                $grade = '小学生';
            } elseif ($grade == 2) {
                $grade = '中学生';
            } else {
                $grade = '高校生';
            }
            $data = [
                'name' => $v,
                'target' => $grade,
                'subject' => $subject,
            ];
            DB::table('areas')->insert($data);
        }
    }
}
